import s from "./PrivacyPolicy.module.css";

const PrivacyPolicy = () => {
  return (
    <div className={s.contText}>
      <h2 className={s.title}>
        ПОЛІТИКА КОНФІДЕНЦІЙНОСТІ ТА ЗАХИСТУ ПЕРСОНАЛЬНИХ ДАНИХ
      </h2>
      <p className={s.text}>
        Управління цим сайтом здійснюється ФОП, яка зареєстрована і діє
        відповідно до вимог законодавства України (далі - «Готель»). Готель з
        великою повагою ставиться до конфіденційної (персональної) інформації
        всіх без винятку осіб, які відвідали Сайт, а також тих, хто користується
        наданими Сайтом сервісами; в зв'язку з чим, Готель прагне захищати
        конфіденційність персональних даних (відомостей чи сукупність відомостей
        про фізичну особу, яка ідентифікована або може бути конкретно
        ідентифікована), тим самим створивши і забезпечивши максимально
        комфортні умови використання сервісів Сайту кожному користувачеві.
      </p>
      <h3 className={s.titleOne}>Захист інформації</h3>
      <p className={s.text}>
        Готель використовує загальноприйняті стандарти технологічного та
        операційного захисту інформації та персональних даних від втрати,
        неправильного використання, зміни або знищення. Однак, не дивлячись на
        всі зусилля, Готель не може гарантувати абсолютну захищеність від
        будь-яких загроз, що виникають поза межами регулювання Готелю. Готель
        забезпечує застосування всіх відповідних зобов'язань щодо дотримання
        конфіденційності, а також технічних і організаційних заходів безпеки для
        запобігання несанкціонованого або незаконного розголошення або обробки
        такої інформації та даних, їх випадкової втрати, знищення або
        пошкодження. Готель надає доступ до інформації і персональних даних
        тільки уповноваженим працівникам, які дали згоду на забезпечення
        конфіденційності такої інформації та даних відповідно до вимог Готелю.
        Поширення персональних даних без згоди суб'єкта персональних даних або
        уповноваженої ним особи дозволяється у випадках, визначених законом, і
        лише (якщо це необхідно) в інтересах національної безпеки, економічного
        добробуту та прав людини.
      </p>
      <h3 className={s.titleOne}>Збір та використання персональних даних</h3>
      <p className={s.text}>
        При використанні користувачем сервісів Сайту Готелем здійснюється
        обробка даних користувача, а саме: даних, що надаються користувачем як
        при заповненні форми: -номер телефону, персональне ім'я.
      </p>
      <p className={s.text}>
        Звертаємо Вашу увагу: Готель обмежується збором мінімального обсягу
        інформації, необхідного виключно для виконання запиту суб'єкта
        персональних даних. У будь-якому випадку, коли запитується необов'язкова
        до надання інформація, користувача буде повідомлено в момент збору такої
        інформації.
      </p>
      <h3 className={s.titleOne}>Інші сайти</h3>
      <p className={s.text}>
        Дана політика конфіденційності стосується тільки нашого сайту. Ми не
        контролюємо сайти, які використовують інформацію з нашого сайту або на
        які ведуть посилання з нашого сайту. Ці сайти можуть розміщувати на Ваш
        комп'ютер власні файли cookie, збирати дані або запитувати у вас
        особисту інформацію.
      </p>
      <h3 className={s.titleOne}>Зміна Політики</h3>
      <p className={s.text}>
        До цієї Політики періодично та без попереднього повідомлення користувача
        про таке можуть вноситись зміни та доповнення, у тому числі, при зміні
        вимог законодавства. Просимо час від часу переглядати Політику для того,
        щоб бути в курсі будь-яких змін або доповнень.
      </p>
    </div>
  );
};

export default PrivacyPolicy;
