import { createSlice } from "@reduxjs/toolkit";

const initialState = {
  rooms: [
    {
      id: 1,
      name: "Номер Люкс 2 кімнати головний корпус",
      price: 2890,
      description:
        "Люкс дво-кімнатний з усіма зручностями, ванною кімнатою та балконом. Чудовий вид на територію готелю та гори. В номері є: телевізор, холодильник, кондиціонер, фен, чайник(Якщо нема блекауту), та багато всього іншого для Вашого комфорту.",
      avatar: "../../public/images/20200704_131924_Original.JPEG",
      images: [
        "../../public/images/20200704_131924_Original.JPEG",
        "../../public/images/20200704_125609_Original.JPEG",
        "../../public/images/20200704_125550_Original.JPEG",
      ],
    },
    {
      id: 2,
      name: "Номер Напівлюкс 3 місний головний корпус",
      price: 2590,
      description:
        "Напівлюкс з усіма зручностями, ванною кімнатою та балконом з видом на територію готелю та гори. В номері є: телевізор, холодильник, кондиціонер, фен, чайник(Якщо нема блекауту), та багато всього іншого для Вашого комфорту.",
      avatar: "../../public/images/20200704_125609_Original.JPEG",
      images: [
        "../../public/images/20200704_125609_Original.JPEG",
        "../../public/images/20200704_131924_Original.JPEG",
        "../../public/images/20200704_125550_Original.JPEG",
      ],
    },
    {
      id: 3,
      name: "Номер Стандарт головний корпус",
      price: 2290,
      description:
        "Стандарт покращений, двомісний номер з ванною кімнатою та балклоном з видом на територію готелю та гори. В номері є: телевізор, холодильник, кондиціонер, фен, чайник(Якщо нема блекауту), та багато всього іншого для Вашого комфорту.",
      avatar: "../../public/images/20200704_125550_Original.JPEG",
      images: [
        "../../public/images/20200704_125550_Original.JPEG",
        "../../public/images/20200704_131924_Original.JPEG",
        "../../public/images/20200704_125609_Original.JPEG",
      ],
    },
    {
      id: 4,
      name: "Номер Економ головний корпус",
      price: 2090,
      description:
        "Економ покращений з роздільними ліжками та балконом, з видом на територію готелю та гори. В номері є: телевізор, холодильник, кондиціонер, фен, чайник(Якщо нема блекауту), та багато всього іншого для Вашого комфорту.",
      avatar: "../../public/images/20200704_131924_Original.JPEG",
      images: [
        "../../public/images/20200704_131924_Original.JPEG",
        "../../public/images/20200704_125609_Original.JPEG",
        "../../public/images/20200704_125550_Original.JPEG",
      ],
    },
    {
      id: 5,
      name: "Номер Люкс 3 кімнати корпус 9",
      price: 1790,
      description:
        "Номер люкс трикімнатний з двома санвузлами (душові), балконом з чудовим видом на гори та територію. В номері є: телевізор, холодильник, кондиціонер, фен, чайник(Якщо нема блекауту), та багато всього іншого для Вашого комфорту.",
      avatar: "../../public/images/20200704_125609_Original.JPEG",
      images: [
        "../../public/images/20200704_125609_Original.JPEG",
        "../../public/images/20200704_131924_Original.JPEG",
        "../../public/images/20200704_125550_Original.JPEG",
      ],
    },
    {
      id: 6,
      name: "Номер Люкс 2 кімнати корпус 9",
      price: 1590,
      description:
        "Люкс двокімнатний з усіма зручностями, савузол з душем, балкон з видом на гори та місцевість. В номері є: телевізор, холодильник, кондиціонер, фен, чайник(Якщо нема блекауту), та багато всього іншого для Вашого комфорту.",
      avatar: "../../public/images/20200704_131924_Original.JPEG",
      images: [
        "../../public/images/20200704_131924_Original.JPEG",
        "../../public/images/20200704_125609_Original.JPEG",
        "../../public/images/20200704_125550_Original.JPEG",
      ],
    },
    {
      id: 7,
      name: "Номер Напівлюкс корпус 9",
      price: 1590,
      description:
        "Напівлюкс з усіма зручностями, савузол з душем, без балкону з гарним видом на гори. В номері є: телевізор, холодильник, кондиціонер, фен, чайник(Якщо нема блекауту), та багато всього іншого для Вашого комфорту.",
      avatar: "../../public/images/20200704_131924_Original.JPEG",
      images: [
        "../../public/images/20200704_131924_Original.JPEG",
        "../../public/images/20200704_125609_Original.JPEG",
        "../../public/images/20200704_125550_Original.JPEG",
      ],
    },
    {
      id: 8,
      name: "Номер Економ корпус 9",
      price: 1590,
      description:
        "Економ з роздільними ліжками, савузол з душем, без балкону з гарним видом на гори. В номері є: телевізор, холодильник, кондиціонер, фен, чайник(Якщо нема блекауту), та багато всього іншого для Вашого комфорту.",
      avatar: "../../public/images/20200704_131924_Original.JPEG",
      images: [
        "../../public/images/20200704_131924_Original.JPEG",
        "../../public/images/20200704_125609_Original.JPEG",
        "../../public/images/20200704_125550_Original.JPEG",
      ],
    },
    {
      id: 9,
      name: "Номер Економ корпус 9-А",
      price: 1590,
      description:
        "Економ з двоспальним ліжком, савузол з ванною, з невеликим балконом з гарним видом на гори. В номері є: телевізор, холодильник, кондиціонер, фен, чайник(Якщо нема блекауту), та багато всього іншого для Вашого комфорту.",
      avatar: "../../public/images/20200704_131924_Original.JPEG",
      images: [
        "../../public/images/20200704_131924_Original.JPEG",
        "../../public/images/20200704_125609_Original.JPEG",
        "../../public/images/20200704_125550_Original.JPEG",
      ],
    },
    {
      id: 10,
      name: "Стандарт Економ корпус 9-А",
      price: 1590,
      description:
        "Стандарт з двоспальним ліжком та розкладним кріслом для дитини, савузол з ванною, з невеликим балконом з гарним видом на гори. В номері є: телевізор, холодильник, кондиціонер, фен, чайник(Якщо нема блекауту), та багато всього іншого для Вашого комфорту.",
      avatar: "../../public/images/20200704_131924_Original.JPEG",
      images: [
        "../../public/images/20200704_131924_Original.JPEG",
        "../../public/images/20200704_125609_Original.JPEG",
        "../../public/images/20200704_125550_Original.JPEG",
      ],
    },
  ],
};

const roomsSlice = createSlice({
  name: "rooms",
  initialState,
  reducers: {},
});

export const selectRooms = (state) => state.rooms.rooms;
export default roomsSlice.reducer;
