import s from "./RegionPage.module.css";

const RegionPage = () => {
  return (
    <div className={s.regionCont}>
      <h2 className={s.regionTitle}>Цікаві місця нашого краю: </h2>
      <ul className={s.regionList}>
        <li className={s.regionItem}>
          <img
            src="https://kiyavia.com/files/travel-provider/zakarpattya/mesta/Vodopad_Shypit_1200.jpg"
            alt="Водоспад Шипіт"
            className={s.regionImg}
          />
          <p className={s.regionText}>
            В самому серці Карпат в підніжжі гори Гимба в буковій ущелині
            знаходиться одне з семи природних чудес України – неймовірно гарний
            каскадний водоспад Шипіт.
          </p>
        </li>
        <li className={s.regionItem}>
          <img
            src="https://kiyavia.com/files/travel-provider/zakarpattya/mesta/Ozero_Synevir_1200.jpg"
            alt="Озеро Синевир"
            className={s.regionImg}
          />
          <p className={s.regionText}>
            Район Національного природного парку «Синевир» - це казковий куточок
            прекрасної природи. Це місце сили і найзагадковіша визначна пам'ятка
            Західної України. Саме тут, захована в густих хвойних лісах Карпат,
            знаходиться справжня природна перлина і одна з візитівок смарагдових
            Карпат – озеро Синевир, яке вражає своїми кришталево чистими і
            глибокими водами. Щороку тисячі туристів приїжджають сюди
            помилуватись найбільшим гірським озером в Україні та насолодитись
            чудовими мальовничими краєвидами навколо.
          </p>
        </li>
        <li className={s.regionItem}>
          <img
            src="https://kiyavia.com/files/travel-provider/zakarpattya/mesta/Selo_Kolochava_1200.jpg"
            alt="Село десяти музеїв Колочава"
            className={s.regionImg}
          />
          <p className={s.regionText}>
            Неподалік від Синевиру знаходиться ще одна туристична родзинка
            Закарпаття. Мальовнича Колочава - одне з найдовших сіл в Україні,
            його довжина складає 15 км. Але знаменита Колочава не лише через це.
            Карпатська глибинка може похвалитися мінеральними джерелами,
            неймовірними краєвидами на гори та давньою історією, адже перша
            письмова згадка про нього датується 1463 р.
          </p>
        </li>
        <li className={s.regionItem}>
          <img
            src="https://kiyavia.com/files/travel-provider/zakarpattya/mesta/Zamok_Shernborna_1200.jpg"
            alt="Замок графа Шенборна"
            className={s.regionImg}
          />
          <p className={s.regionText}>
            Серед дивовижних архітектурних пам’яток Західної України можна
            виділити казковий мисливський замок Шенборн. Він зберігся майже в
            первісному вигляді як всередині, так і зовні. Особливу увагу слід
            приділити своєрідній архітектурі замку. Відповідно до астрономічних
            принципів, кожен з елементів фасаду має особливу символічну
            інтерпретацію. Таким чином, замок має рівно 365 вікон, які
            представляють дні року (на випадок високосного року в палаці Шенборн
            є ще одне замуроване вікно), 52 кімнати, які символізують кількість
            тижнів на рік, та 12 входів на кожен місяць року.
          </p>
        </li>
        <li className={s.regionItem}>
          <img
            src="https://kiyavia.com/files/travel-provider/zakarpattya/mesta/Zamok_Sent_Mikloch_1200.jpg"
            alt="Замок Сент-Міклош"
            className={s.regionImg}
          />
          <p className={s.regionText}>
            Побудований в 15 сторіччі як фортеця, замок Сент-Міклош за часи
            свого існування змінив багато господарів та був свідком різних
            історичних подій – героїчних, трагічних, драматичних і романтичних.
            Він знав часи розквіту та пережив період занепаду. З 19 століття,
            після того як протягом двохсот років замком володіли графи Шенборни,
            Чинадіївським замком ніхто не опікувався, його використовували за
            різними призначеннями без належного догляду, і він потроху упадав та
            руйнувався. У 2001 році родина закарпатських художників Єжи Бартоша
            та Тетяни Петричко-Бартош вирішила врятувати історичну пам’ятку та
            взяли замок в оренду. Їм вдалось відродити унікальний історичний
            пам’ятник культури та архітектури та привернути до нього увагу
            туристів.
          </p>
        </li>
        <li className={s.regionItem}>
          <img
            src="https://kiyavia.com/files/travel-provider/zakarpattya/mesta/Ferma_oleney_1200.jpg"
            alt="Оленяча ферма"
            className={s.regionImg}
          />
          <p className={s.regionText}>
            Ще одна надзвичайно приваблива та дуже мила туристична атракція
            Закарпаття розмістилась поміж селами Іза та Липча поблизу містечка
            Хуст. Це єдине в Україні фермерське господарство, яке утримує
            плямистих оленів. Заснували його більше 30 років тому. Зараз у
            фермерському хазяйстві налічують понад 300 цих рогатих красенів, які
            живуть в природному середовищі на 57 гектарах пасовищ, лісів і
            штучних ставків.
          </p>
        </li>
        <li className={s.regionItem}>
          <img
            src="https://kiyavia.com/files/travel-provider/zakarpattya/mesta/Zamok_Palanok_1200.jpg"
            alt="Мукачівський замок Паланок"
            className={s.regionImg}
          />
          <p className={s.regionText}>
            Мукачівський замок Паланок є історичною і воєнно-архітектурною
            пам’яткою і одним з кращих замків Центральної Європи. Він височіє на
            Замковій горі вулканічного походження висотою 68 метрів на околиці
            міста Мукачево. Свою назву «Паланок» замок взяв від дубового
            частоколу – паланка, яким колись була оточена Замкова гора.
          </p>
        </li>
        <li className={s.regionItem}>
          <img
            src="https://kiyavia.com/files/travel-provider/zakarpattya/mesta/Lozopletenie_Zakarpatie_1200.jpg"
            alt="Лозоплетіння в с.Іза"
            className={s.regionImg}
          />
          <p className={s.regionText}>
            Село Іза Хустського району відоме далеко за межами Закарпатської
            області. І все завдяки ремеслу лозоплетіння, яке місцеві жителі
            вдосконалили і довели до рівня мистецтва.
          </p>
        </li>
        <li className={s.regionItem}>
          <img
            src="https://kiyavia.com/files/travel-provider/zakarpattya/mesta/Syrovarnya_Zakarpatie.jpg"
            alt="Селиська сироварня в Карпатах"
            className={s.regionImg}
          />
          <p className={s.regionText}>
            Ще одне знане на всю Україну село з Хустського району - це Нижнє
            Селище. Відоме воно своїми справжніми натуральними сирами, які з
            2002 року виготовляються за швейцарською технологією в місцевій
            сироварні, аналогів якій в Україні немає. В процесі виробництва не
            використовують консерванти, шкідливі домішки, ароматизатори та
            барвники. Лише справжнє молоко, яке закуповують у місцевих селян.
            Для туристів на сироварні влаштовують екскурсії, під час яких можна
            на власні очі побачити як молоко перетворюється на сир та скуштувати
            кілька видів сиру: «Хуст», «Селиський молодий», «Селиський зрілий» і
            «Нарцис Карпат». До речі, приготування натурального сиру – тривалий
            процес. Наприклад, закарпатський сир “Нарцис Карпат” дозріває
            півроку у вологому і прохолодному підвалі Селиської сироварні.
          </p>
        </li>
        <li className={s.regionItem}>
          <img
            src="https://kiyavia.com/files/travel-provider/zakarpattya/mesta/Ferma_strausov.jpg"
            alt="Страусина ферма в Карпатах"
            className={s.regionImg}
          />
          <p className={s.regionText}>
            Страусині ферми є в багатьох куточках України. На них не тільки
            розводять цих екзотичних птахів, а й влаштовують екскурсії для
            туристів. В закарпатському містечку Хуст також є страусовий
            розплідник, який налічує понад 30 птахів. Туристам можна принести з
            собою хліб, капусту та яблука, аби погодувати страусів. На території
            ферми можна придбати страусині яйця та пір’я, а також можна зробити
            досхочу гарних фото на згадку. Найбільшою популярністю користуються
            фото зі страусиним яйцем в руках або стоячи на ньому. Радимо
            допомогти малечі тримати цей аксесуар для фото – важить таке яйце
            від 1 до 2 кг. На фермі ще живуть поні та 2 кізоньки, які теж
            полюбляють позувати для фото за невеличкий смаколик.
          </p>
        </li>
        <li className={s.regionItem}>
          <img
            src="https://kiyavia.com/files/travel-provider/zakarpattya/mesta/Dolina_narcyssov_1200.jpg"
            alt="Долина нарцисів у Карпатах"
            className={s.regionImg}
          />
          <p className={s.regionText}>
            Місто Хуст зібрало навколо себе багато історичних та просто цікавих
            пам’яток. Серед них є і дійсно особливе природне диво, справжня
            туристична родзинка Закарпаття – Долина нарцисів в урочищі Кіреші.
            Ця ботанічна пам’ятка офіційно охороняється ще з часів, коли ці
            землі були власністю Австро-Угорщини, тепер же Долина належить
            Карпатському біосферному заповіднику, який зберігає цю цінну
            екосистему на території понад 250 га лук і боліт. Долина нарцисів –
            унікальна і за розміром, і за розташуванням. Зазвичай ця тендітна
            квітка царює на висоті від тисячі метрів над рівнем моря. Подібні
            природні осередки нарцисів є в Альпах, Румунії та трохи на Балканах.
            Закарпатська ж Долина - це найбільша у Середній Європі популяція
            нарцису вузьколистого на висоті всього 180-200 метрів над рівнем
            моря. З 1992 року Долина нарцисів входить до міжнародної мережі
            біосферних заповідників ЮНЕСКО.
          </p>
        </li>
        <li className={s.regionItem}>
          <img
            src="https://kiyavia.com/files/travel-provider/zakarpattya/mesta/Termalnie_basseyny.jpg"
            alt="Термальні басейни Закарпаття"
            className={s.regionImg}
          />
          <p className={s.regionText}>
            На Закарпатті можна і добре та цікаво відпочити, і покращити своє
            здоров'я, приймаючи ванни у термальних джерелах. Цей мальовничий
            куточок є лідером в Україні по кількості бальнеологічних курортів,
            тут знаходиться понад 50 термальних джерел різного роду
            мінералізації. А найбільш популярні термальні курорти розташовані в
            Берегово, Косино та Велятино. Село Довгий та місто Мукачеве також
            славляться своїми цілющими водами. Термальні води Закарпаття багаті
            на залізо, марганець, калій, кремній, натрій та інші мікроелементи.
            На термальних курортах Закарпаття лікуються захворювання, пов’язані
            з опорно-руховим апаратом, серцево-судинною системою, периферійною
            нервовою системою, периферійними судинами та біліарною системою.
          </p>
        </li>
        <li className={s.regionItem}>
          <img
            src="https://kiyavia.com/files/travel-provider/zakarpattya/mesta/Zamok_Ujgorod_1200.jpg"
            alt="Ужгородський замок"
            className={s.regionImg}
          />
          <p className={s.regionText}>
            Високо на Замковій горі над історичним центром Ужгорода велично
            височіє Ужгородський замок, оповитий таємницями та легендами. Коли
            була побудована ця фортеця достеменно невідомо, але з давніх давен
            на цьому місці знаходилась оборонна споруда. Перша згадка про замок
            з’явилась в письмових джерелах IX ст., щоправда там йдеться не про
            кам’яну, а про дерев’яну фортецю білих хорватів. Ужгородський замок
            відбив немало атак, витримав тривалі облоги та вистояв в багатьох
            битвах. Це не ажурний палац, як можна собі уявити, почувши слово
            «замок», а справжня бойова фортеця з грізними квадратними вежами,
            товстезними стінами, похмурими отворами бійниць та ретельно
            продуманими та розрахованими фортифікаційними укріпленнями. Під час
            військових дій в замку переховувалась як аристократія, так і
            чисельні городяни, тому під замком є глибокі підземелля. Там
            розміщуються, зокрема, в’язниця та кімната для тортур, які можна
            побачити і зараз. Нині в приміщенні Ужгородського замку розміщуються
            цікаві експозиції краєзнавчого музею.
          </p>
        </li>
      </ul>
    </div>
  );
};

export default RegionPage;
